In [1]:
#!usr/bin/env python3
import os
import pandas as pd
import dateutil #https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/
from datetime import datetime
import glob
import time
from pathlib import Path

# Hide warning messages in notebook
import warnings
warnings.filterwarnings('ignore')

In [2]:
pd.set_option("max_rows", 100)

In [3]:
cur_dir = os.getcwd()
cur_dir

'/Users/Werd/boot_camp/gitlib/tableau-citibike'

In [4]:
cleansed_dir = os.path.join(cur_dir,'citibike_files','cleansed')
cleansed_dir

'/Users/Werd/boot_camp/gitlib/tableau-citibike/citibike_files/cleansed'

In [5]:
path = cleansed_dir

all_files = sorted(glob.glob(os.path.join(path, "*citibike*")))

all_df = []

#parse_dates=['starttime','stoptime'],

for f in all_files:
    try: 
        file_name = f.split('/')[-1] 
        df = pd.read_csv(f, sep=',',header = 1,skiprows = 1)
        row_count = (len(df.index))
        base, ext = os.path.splitext(file_name)
        base = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed', file_name))
        #print(f"{base}_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','{file_name}'))")
        print(f"{file_name}   [rowcount: {row_count}]")
    except:
         print('except:' + f)

citibike_bikes.csv   [rowcount: 6809]
citibike_customers.csv   [rowcount: 15328]
citibike_distinct_stations.csv   [rowcount: 343]
citibike_distinct_stations_final.csv   [rowcount: 343]
citibike_start_stations.csv   [rowcount: 118149]
citibike_trips_daily.csv   [rowcount: 363]
citibike_trips_hourly.csv   [rowcount: 8756]

In [6]:
cur_dir = os.getcwd()

In [7]:
citibike_bike_date_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_bikes.csv'))
#citibike_bike_date_df.set_index('bikeid',inplace=True)
#citibike_bike_date_df.sort_index(axis = 0) 
citibike_bike_date_df

             min         max  count           sum
0     2014-01-06  2014-12-31   1439  19885.816667
1     2014-01-14  2014-12-31   1603  22154.166667
2     2014-01-01  2014-12-31   1234  17111.166667
3     2014-01-04  2014-12-30    992  14490.800000
4     2014-01-06  2014-12-31   1521  20760.333333
...          ...         ...    ...           ...
6806  2014-05-17  2014-12-31   1385  20525.516667
6807  2014-06-29  2014-12-31    972  13262.000000
6808  2014-08-21  2014-11-08    484   6830.066667
6809  2014-08-27  2014-11-13    539   8158.866667
6810  2014-09-18  2014-12-31    439   7068.150000

[6811 rows x 4 columns]

In [8]:
citibike_customer_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_customers.csv'))
# citibike_customer_df.set_index('startdate',inplace=True)
# citibike_customer_df.sort_index(axis = 0) 
citibike_customer_df

        startdate  gender  age bracket    usertype  count
0      2014-01-01       0      (-1, 1]    Customer    652
1      2014-01-01       0      (-1, 1]  Subscriber      0
2      2014-01-01       0      (1, 18]    Customer      0
3      2014-01-01       0      (1, 18]  Subscriber      0
4      2014-01-01       0     (18, 25]    Customer      0
...           ...     ...          ...         ...    ...
15325  2014-12-31       2     (45, 65]  Subscriber    638
15326  2014-12-31       2    (65, 100]    Customer      0
15327  2014-12-31       2    (65, 100]  Subscriber     79
15328  2014-12-31       2  (100, 1000]    Customer      0
15329  2014-12-31       2  (100, 1000]  Subscriber      0

[15330 rows x 5 columns]

In [9]:
citibike_distinct_station_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_distinct_stations.csv'))
# citibike_distinct_station_csv_df.set_index('station id',inplace=True)
# citibike_distinct_station_csv_df.sort_index(axis = 0) 
citibike_distinct_station_df

,station id,station latitude,station longitude,station name
0,228,40.755,-73.972,E 48 St & 3 Ave
1,519,40.752,-73.978,Pershing Square N
2,83,40.684,-73.976,Atlantic Ave & Fort Greene Pl
3,422,40.771,-73.988,W 59 St & 10 Ave
4,516,40.752,-73.968,E 47 St & 1 Ave
...,...,...,...,...
340,279,40.708,-74.002,Peck Slip & Front Street
341,519,40.752,-73.978,Pershing Square North
342,517,40.752,-73.978,Pershing Square South
343,538,40.757,-73.977,E 48 St & Madison Ave
344,527,40.744,-73.976,E 33 St & 2 Ave

In [10]:
citibike_start_station_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_start_stations.csv'))
# citibike_start_station_df.set_index('station id',inplace=True)
# citibike_start_station_df.sort_index(axis = 0) 
citibike_start_station_df

,start station id,start station latitude,start station longitude,count
0,72,40.767,-73.994,6
1,79,40.719,-74.007,17
2,82,40.711,-74.000,13
3,83,40.684,-73.976,17
4,116,40.742,-74.001,28
...,...,...,...,...
118146,2017,40.750,-73.971,18
118147,2021,40.759,-73.989,13
118148,2022,40.758,-73.959,20
118149,2023,40.760,-73.970,11
118150,3002,40.712,-74.016,35

In [11]:
citibike_trips_daily_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_daily.csv'))
# citibike_trips_daily_df.set_index('startdate',inplace=True)
# citibike_trips_daily_df.sort_index(axis = 0) 
citibike_trips_daily_df

     count            sum
0     6057   93139.183333
1     8600  111630.816667
2     1144   15316.866667
3     2292   46752.783333
4     2678   36788.500000
..     ...            ...
360  10247  165377.800000
361   7902  103078.233333
362  13549  179936.916667
363  12196  140264.933333
364   9739  123474.400000

[365 rows x 2 columns]

In [12]:
citibike_trips_hourly_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_hourly.csv'))
# citibike_trips_hourly_df.set_index(['startdate'],inplace=True)
# citibike_trips_hourly_df.sort_index(axis = 0) 
citibike_trips_hourly_df

      starthour  count          sum
0             0    113  1737.100000
1             1    204  4577.666667
2             2    161  4045.116667
3             3    144  3795.016667
4             4     61   521.366667
...         ...    ...          ...
8753         19    285  2964.983333
8754         20    198  3698.850000
8755         21    159  1886.316667
8756         22    173  3080.716667
8757         23    121  2865.366667

[8758 rows x 3 columns]

## Bikes